#include "header.h"
#include <iostream>
using namespace std;

int main()
{
	//===if===
	//두수비교하기_1330();
	//시험성적_9498();
	//윤년_2753();
	//알람시계_2884();

	//===for===
	//구구단_2739();
	//AB3_10950();
	//합_8393();
	//빠른AB_15552();
	//별찍기오른쪽정렬_2439();

	//===1차원배열===
	//최소최대_10818();
	//최댓값_2562();
	//숫자의갯수_2577();
	//나머지_3052();
	//평균_1546();
	//평균은넘겠지_4344();
	//한수_1065();

	//===문자열===
	//아스키코드_11654();
	//알파벳찾기_10809();
	//문자열반복_2675();
	//단어공부_1157();
	//단어의개수_1152();
	//상수_2908();
	//다이얼_5622();
	//크로아티아알파벳_2941();
	//그룹단어체커_1316();


	//=== 수학1 ===
	//손익분기점_1712();
	//벌집_2292();
	//분수찾기_1193();
	//달팽이는올라가고싶다_2869();
	//ACM호텔_10250();
	//부녀회장이될테야_2275();
	//큰수AB_10757();
	FlymetotheAlphaCentauri_1011();


	// === DFS와BFS ===
	//DFS와BFS_1260();


	// ===재귀함수 ===
	//팩토리얼_10872();
	//피보나치수5_10870();
	//별찍기_2447();

	//===함수===
	//고양이_10171();
	//셀프넘버_4673();
	return 0;

}